{
  "componentDescription": "",
  "propDescriptions": {
    "autoFocus": {
      "description": "If <code>true</code>, the main element is focused during the first mount. This main element is: - the element chosen by the visible view if any (i.e: the selected day on the <code>day</code> view). - the <code>input</code> element if there is a field rendered."
    },
    "closeOnSelect": {
      "description": "If <code>true</code>, the popover or modal will close after submitting the full date."
    },
    "dayOfWeekFormatter": {
      "description": "Formats the day of week displayed in the calendar header.",
      "typeDescriptions": {
        "date": "The date of the day of week provided by the adapter.",
        "string": "The name to display."
      }
    },
    "defaultValue": {
      "description": "The default value. Used when the component is not controlled."
    },
    "desktopModeMediaQuery": {
      "description": "CSS media query when <code>Mobile</code> mode will be changed to <code>Desktop</code>."
    },
    "disabled": { "description": "If <code>true</code>, the picker and text field are disabled." },
    "disableFuture": {
      "description": "If <code>true</code>, disable values after the current date for date components, time for time components and both for date time components."
    },
    "disableHighlightToday": {
      "description": "If <code>true</code>, today&#39;s date is rendering without highlighting with circle."
    },
    "disableOpenPicker": {
      "description": "If <code>true</code>, the open picker button will not be rendered (renders only the field)."
    },
    "disablePast": {
      "description": "If <code>true</code>, disable values before the current date for date components, time for time components and both for date time components."
    },
    "displayWeekNumber": {
      "description": "If <code>true</code>, the week number will be display in the calendar."
    },
    "fixedWeekNumber": {
      "description": "The day view will show as many weeks as needed after the end of the current month to match this value. Put it to 6 to have a fixed number of weeks in Gregorian calendars"
    },
    "format": {
      "description": "Format of the date when rendered in the input(s). Defaults to localized format based on the used <code>views</code>."
    },
    "formatDensity": {
      "description": "Density of the format when rendered in the input. Setting <code>formatDensity</code> to <code>&quot;spacious&quot;</code> will add a space before and after each <code>/</code>, <code>-</code> and <code>.</code> character."
    },
    "inputRef": { "description": "Pass a ref to the <code>input</code> element." },
    "label": { "description": "The label content." },
    "loading": {
      "description": "If <code>true</code>, calls <code>renderLoading</code> instead of rendering the day calendar. Can be used to preload information and show it in calendar."
    },
    "localeText": {
      "description": "Locale for components texts. Allows overriding texts coming from <code>LocalizationProvider</code> and <code>theme</code>."
    },
    "maxDate": { "description": "Maximal selectable date." },
    "minDate": { "description": "Minimal selectable date." },
    "monthsPerRow": { "description": "Months rendered per row." },
    "name": {
      "description": "Name attribute used by the <code>input</code> element in the Field."
    },
    "onAccept": {
      "description": "Callback fired when the value is accepted.",
      "typeDescriptions": {
        "value": "The value that was just accepted.",
        "context": "The context containing the validation result of the current value."
      }
    },
    "onChange": {
      "description": "Callback fired when the value changes.",
      "typeDescriptions": {
        "value": "The new value.",
        "context": "The context containing the validation result of the current value."
      }
    },
    "onClose": {
      "description": "Callback fired when the popup requests to be closed. Use in controlled mode (see <code>open</code>)."
    },
    "onError": {
      "description": "Callback fired when the error associated to the current value changes. If the error has a non-null value, then the <code>TextField</code> will be rendered in <code>error</code> state.",
      "typeDescriptions": {
        "error": "The new error describing why the current value is not valid.",
        "value": "The value associated to the error."
      }
    },
    "onMonthChange": {
      "description": "Callback fired on month change.",
      "typeDescriptions": { "month": "The new month." }
    },
    "onOpen": {
      "description": "Callback fired when the popup requests to be opened. Use in controlled mode (see <code>open</code>)."
    },
    "onSelectedSectionsChange": {
      "description": "Callback fired when the selected sections change.",
      "typeDescriptions": { "newValue": "The new selected sections." }
    },
    "onViewChange": {
      "description": "Callback fired on view change.",
      "typeDescriptions": { "view": "The new view." }
    },
    "onYearChange": {
      "description": "Callback fired on year change.",
      "typeDescriptions": { "year": "The new year." }
    },
    "open": { "description": "Control the popup or dialog open state." },
    "openTo": {
      "description": "The default visible view. Used when the component view is not controlled. Must be a valid option from <code>views</code> list."
    },
    "orientation": { "description": "Force rendering in particular orientation." },
    "reduceAnimations": { "description": "If <code>true</code>, disable heavy animations." },
    "referenceDate": {
      "description": "The date used to generate the new value when both <code>value</code> and <code>defaultValue</code> are empty."
    },
    "renderLoading": {
      "description": "Component displaying when passed <code>loading</code> true.",
      "typeDescriptions": { "React.ReactNode": "The node to render when loading." }
    },
    "selectedSections": {
      "description": "The currently selected sections. This prop accepts four formats: 1. If a number is provided, the section at this index will be selected. 2. If a string of type <code>FieldSectionType</code> is provided, the first section with that name will be selected. 3. If <code>&quot;all&quot;</code> is provided, all the sections will be selected. 4. If <code>null</code> is provided, no section will be selected. If not provided, the selected sections will be handled internally."
    },
    "shouldDisableDate": {
      "description": "Disable specific date.<br>Warning: This function can be called multiple times (for example when rendering date calendar, checking if focus can be moved to a certain date, etc.). Expensive computations can impact performance.",
      "typeDescriptions": {
        "day": "The date to test.",
        "boolean": "If <code>true</code> the date will be disabled."
      }
    },
    "shouldDisableMonth": {
      "description": "Disable specific month.",
      "typeDescriptions": {
        "month": "The month to test.",
        "boolean": "If <code>true</code>, the month will be disabled."
      }
    },
    "shouldDisableYear": {
      "description": "Disable specific year.",
      "typeDescriptions": {
        "year": "The year to test.",
        "boolean": "If <code>true</code>, the year will be disabled."
      }
    },
    "showDaysOutsideCurrentMonth": {
      "description": "If <code>true</code>, days outside the current month are rendered:<br>- if <code>fixedWeekNumber</code> is defined, renders days to have the weeks requested.<br>- if <code>fixedWeekNumber</code> is not defined, renders day to fill the first and last week of the current month.<br>- ignored if <code>calendars</code> equals more than <code>1</code> on range pickers."
    },
    "slotProps": { "description": "The props used for each component slot." },
    "slots": { "description": "Overridable component slots." },
    "sx": {
      "description": "The system prop that allows defining system overrides as well as additional CSS styles."
    },
    "timezone": {
      "description": "Choose which timezone to use for the value. Example: &quot;default&quot;, &quot;system&quot;, &quot;UTC&quot;, &quot;America/New_York&quot;. If you pass values from other timezones to some props, they will be converted to this timezone before being used.",
      "seeMoreText": "See the {{link}} for more details."
    },
    "value": { "description": "The selected value. Used when the component is controlled." },
    "view": {
      "description": "The visible view. Used when the component view is controlled. Must be a valid option from <code>views</code> list."
    },
    "viewRenderers": {
      "description": "Define custom view renderers for each section. If <code>null</code>, the section will only have field editing. If <code>undefined</code>, internally defined view will be used."
    },
    "views": { "description": "Available views." },
    "yearsPerRow": { "description": "Years rendered per row." }
  },
  "classDescriptions": {},
  "slotDescriptions": {
    "actionBar": "Custom component for the action bar, it is placed below the picker views.",
    "calendarHeader": "Custom component for calendar header. Check the <a href=\"https://mui.com/x/api/date-pickers/pickers-calendar-header/\">PickersCalendarHeader</a> component.",
    "clearButton": "Button to clear the value.",
    "clearIcon": "Icon to display inside the clear button.",
    "day": "Custom component for day. Check the <a href=\"https://mui.com/x/api/date-pickers/pickers-day/\">PickersDay</a> component.",
    "desktopPaper": "Custom component for the paper rendered inside the desktop picker&#39;s Popper.",
    "desktopTransition": "Custom component for the desktop popper <a href=\"https://mui.com/material-ui/transitions/\">Transition</a>.",
    "desktopTrapFocus": "Custom component for trapping the focus inside the views on desktop.",
    "dialog": "Custom component for the dialog inside which the views are rendered on mobile.",
    "field": "Component used to enter the date with the keyboard.",
    "inputAdornment": "Component displayed on the start or end input adornment used to open the picker on desktop.",
    "layout": "Custom component for wrapping the layout. It wraps the toolbar, views, action bar, and shortcuts.",
    "leftArrowIcon": "Icon displayed in the left view switch button.",
    "mobilePaper": "Custom component for the paper rendered inside the mobile picker&#39;s Dialog.",
    "mobileTransition": "Custom component for the mobile dialog <a href=\"https://mui.com/material-ui/transitions/\">Transition</a>.",
    "monthButton": "Button displayed to render a single month in the &quot;month&quot; view.",
    "nextIconButton": "Button allowing to switch to the right view.",
    "openPickerButton": "Button to open the picker on desktop.",
    "openPickerIcon": "Icon displayed in the open picker button on desktop.",
    "popper": "Custom component for the popper inside which the views are rendered on desktop.",
    "previousIconButton": "Button allowing to switch to the left view.",
    "rightArrowIcon": "Icon displayed in the right view switch button.",
    "shortcuts": "Custom component for the shortcuts.",
    "switchViewButton": "Button displayed to switch between different calendar views.",
    "switchViewIcon": "Icon displayed in the SwitchViewButton. Rotated by 180° when the open view is &quot;year&quot;.",
    "textField": "Form control with an input to render the value inside the default field.",
    "toolbar": "Custom component for the toolbar rendered above the views.",
    "yearButton": "Button displayed to render a single year in the &quot;year&quot; view."
  }
}
