{
  "componentDescription": "",
  "propDescriptions": {
    "colors": { "description": "Color palette used to colorize multiple series." },
    "dataset": {
      "description": "An array of objects that can be used to populate series and axes data using their <code>dataKey</code> property."
    },
    "height": {
      "description": "The height of the chart in px. If not defined, it takes the height of the parent element."
    },
    "hideLegend": { "description": "If <code>true</code>, the legend is not rendered." },
    "highlightedItem": {
      "description": "The highlighted item. Used when the highlight is controlled."
    },
    "id": {
      "description": "This prop is used to help implement the accessibility logic. If you don&#39;t provide this prop. It falls back to a randomly generated id."
    },
    "loading": { "description": "If <code>true</code>, a loading overlay is displayed." },
    "margin": {
      "description": "The margin between the SVG and the drawing area. It&#39;s used for leaving some space for extra information such as the x- and y-axis or legend. Accepts an object with the optional properties: <code>top</code>, <code>bottom</code>, <code>left</code>, and <code>right</code>."
    },
    "onHighlightChange": {
      "description": "The callback fired when the highlighted item changes.",
      "typeDescriptions": { "highlightedItem": "The newly highlighted item." }
    },
    "onItemClick": { "description": "Callback fired when a pie arc is clicked." },
    "series": {
      "description": "The series to display in the pie chart. An array of <a href='/x/api/charts/pie-series-type/'>PieSeriesType</a> objects."
    },
    "skipAnimation": {
      "description": "If <code>true</code>, animations are skipped. If unset or <code>false</code>, the animations respects the user&#39;s <code>prefers-reduced-motion</code> setting."
    },
    "slotProps": { "description": "The props used for each component slot." },
    "slots": { "description": "Overridable component slots." },
    "width": {
      "description": "The width of the chart in px. If not defined, it takes the width of the parent element."
    }
  },
  "classDescriptions": {},
  "slotDescriptions": {
    "legend": "Custom rendering of the legend.",
    "legendLabelMark": "Symbol next to the legend.",
    "loadingOverlay": "Overlay component rendered when the chart is in a loading state.",
    "noDataOverlay": "Overlay component rendered when the chart has no data to display.",
    "pieArc": "",
    "pieArcLabel": "",
    "tooltip": "Custom component for the tooltip popper."
  }
}
