{
  "componentDescription": "It sets up the data providers as well as the `<svg>` for the chart.\n\nThis is a combination of both the `ChartDataProvider` and `ChartsSurface` components.",
  "propDescriptions": {
    "colors": { "description": "Color palette used to colorize multiple series." },
    "dataset": {
      "description": "An array of objects that can be used to populate series and axes data using their <code>dataKey</code> property."
    },
    "disableAxisListener": {
      "description": "If <code>true</code>, the charts will not listen to the mouse move event. It might break interactive features, but will improve performance."
    },
    "disableVoronoi": { "description": "If true, the voronoi interaction are ignored." },
    "height": {
      "description": "The height of the chart in px. If not defined, it takes the height of the parent element."
    },
    "highlightedItem": {
      "description": "The highlighted item. Used when the highlight is controlled."
    },
    "id": {
      "description": "This prop is used to help implement the accessibility logic. If you don&#39;t provide this prop. It falls back to a randomly generated id."
    },
    "margin": {
      "description": "The margin between the SVG and the drawing area. It&#39;s used for leaving some space for extra information such as the x- and y-axis or legend.<br>Accepts a <code>number</code> to be used on all sides or an object with the optional properties: <code>top</code>, <code>bottom</code>, <code>left</code>, and <code>right</code>."
    },
    "onAxisClick": {
      "description": "The function called for onClick events. The second argument contains information about all line/bar elements at the current mouse position.",
      "typeDescriptions": {
        "event": "The mouse event recorded on the <code>&lt;svg/&gt;</code> element.",
        "data": "The data about the clicked axis and items associated with it."
      }
    },
    "onHighlightChange": {
      "description": "The callback fired when the highlighted item changes.",
      "typeDescriptions": { "highlightedItem": "The newly highlighted item." }
    },
    "onItemClick": {
      "description": "Callback fired when clicking close to an item. This is only available for scatter plot for now.",
      "typeDescriptions": {
        "event": "Mouse event caught at the svg level",
        "scatterItemIdentifier": "Identify which item got clicked"
      }
    },
    "series": {
      "description": "The array of series to display. Each type of series has its own specificity. Please refer to the appropriate docs page to learn more about it."
    },
    "skipAnimation": {
      "description": "If <code>true</code>, animations are skipped. If unset or <code>false</code>, the animations respects the user&#39;s <code>prefers-reduced-motion</code> setting."
    },
    "voronoiMaxRadius": {
      "description": "Defines the maximal distance between a scatter point and the pointer that triggers the interaction. If <code>undefined</code>, the radius is assumed to be infinite."
    },
    "width": {
      "description": "The width of the chart in px. If not defined, it takes the width of the parent element."
    },
    "xAxis": {
      "description": "The configuration of the x-axes. If not provided, a default axis config is used. An array of <a href='/x/api/charts/axis-config/'>AxisConfig</a> objects."
    },
    "yAxis": {
      "description": "The configuration of the y-axes. If not provided, a default axis config is used. An array of <a href='/x/api/charts/axis-config/'>AxisConfig</a> objects."
    },
    "zAxis": { "description": "The configuration of the z-axes." }
  },
  "classDescriptions": {}
}
