{
  "componentDescription": "",
  "propDescriptions": {
    "autoFocus": "If <code>true</code>, the main element is focused during the first mount. This main element is: - the element chosen by the visible view if any (i.e: the selected day on the <code>day</code> view). - the <code>input</code> element if there is a field rendered.",
    "calendars": "The number of calendars to render on <strong>desktop</strong>.",
    "className": "Class name applied to the root element.",
    "closeOnSelect": "If <code>true</code>, the popover or modal will close after submitting the full date.",
    "components": "Overridable components.",
    "componentsProps": "The props used for each component slot.",
    "dayOfWeekFormatter": "Formats the day of week displayed in the calendar header.<br><br><strong>Signature:</strong><br><code>function(day: string) =&gt; string</code><br><em>day:</em> The day of week provided by the adapter&#39;s method <code>getWeekdays</code>.<br> <em>returns</em> (string): The name to display.",
    "defaultCalendarMonth": "Default calendar month displayed when <code>value={[null, null]}</code>.",
    "defaultRangePosition": "The initial position in the edited date range. Used when the component is not controlled.",
    "defaultValue": "The default value. Used when the component is not controlled.",
    "disableAutoMonthSwitching": "If <code>true</code>, after selecting <code>start</code> date calendar will not automatically switch to the month of <code>end</code> date.",
    "disabled": "If <code>true</code>, the picker and text field are disabled.",
    "disableDragEditing": "If <code>true</code>, editing dates by dragging is disabled.",
    "disableFuture": "If <code>true</code>, disable values after the current date for date components, time for time components and both for date time components.",
    "disableHighlightToday": "If <code>true</code>, today&#39;s date is rendering without highlighting with circle.",
    "disableOpenPicker": "If <code>true</code>, the open picker button will not be rendered (renders only the field).",
    "disablePast": "If <code>true</code>, disable values before the current date for date components, time for time components and both for date time components.",
    "displayWeekNumber": "If <code>true</code>, the week number will be display in the calendar.",
    "fixedWeekNumber": "Calendar will show more weeks in order to match this value. Put it to 6 for having fix number of week in Gregorian calendars",
    "format": "Format of the date when rendered in the input(s). Defaults to localized format based on the used <code>views</code>.",
    "formatDensity": "Density of the format when rendered in the input. Setting <code>formatDensity</code> to <code>&quot;spacious&quot;</code> will add a space before and after each <code>/</code>, <code>-</code> and <code>.</code> character.",
    "inputRef": "Pass a ref to the <code>input</code> element. Ignored if the field has several inputs.",
    "label": "The label content. Ignored if the field has several inputs.",
    "loading": "If <code>true</code>, calls <code>renderLoading</code> instead of rendering the day calendar. Can be used to preload information and show it in calendar.",
    "localeText": "Locale for components texts. Allows overriding texts coming from <code>LocalizationProvider</code> and <code>theme</code>.",
    "maxDate": "Maximal selectable date.",
    "minDate": "Minimal selectable date.",
    "onAccept": "Callback fired when the value is accepted.<br><br><strong>Signature:</strong><br><code>function(value: TValue) =&gt; void</code><br><em>value:</em> The value that was just accepted.",
    "onChange": "Callback fired when the value changes.<br><br><strong>Signature:</strong><br><code>function(value: TValue, context: FieldChangeHandlerContext&lt;TError&gt;) =&gt; void</code><br><em>value:</em> The new value.<br><em>context:</em> The context containing the validation result of the current value.",
    "onClose": "Callback fired when the popup requests to be closed. Use in controlled mode (see <code>open</code>).",
    "onError": "Callback fired when the error associated to the current value changes. If the error has a non-null value, then the <code>TextField</code> will be rendered in <code>error</code> state.<br><br><strong>Signature:</strong><br><code>function(error: TError, value: TValue) =&gt; void</code><br><em>error:</em> The new error describing why the current value is not valid.<br><em>value:</em> The value associated to the error.",
    "onMonthChange": "Callback fired on month change.<br><br><strong>Signature:</strong><br><code>function(month: TDate) =&gt; void</code><br><em>month:</em> The new month.",
    "onOpen": "Callback fired when the popup requests to be opened. Use in controlled mode (see <code>open</code>).",
    "onRangePositionChange": "Callback fired when the range position changes.<br><br><strong>Signature:</strong><br><code>function(rangePosition: RangePosition) =&gt; void</code><br><em>rangePosition:</em> The new range position.",
    "onSelectedSectionsChange": "Callback fired when the selected sections change.<br><br><strong>Signature:</strong><br><code>function(newValue: FieldSelectedSections) =&gt; void</code><br><em>newValue:</em> The new selected sections.",
    "open": "Control the popup or dialog open state.",
    "rangePosition": "The position in the currently edited date range. Used when the component position is controlled.",
    "reduceAnimations": "Disable heavy animations.",
    "renderLoading": "Component displaying when passed <code>loading</code> true.<br><br><strong>Signature:</strong><br><code>function() =&gt; React.ReactNode</code><br><br> <em>returns</em> (React.ReactNode): The node to render when loading.",
    "selectedSections": "The currently selected sections. This prop accept four formats: 1. If a number is provided, the section at this index will be selected. 2. If an object with a <code>startIndex</code> and <code>endIndex</code> properties are provided, the sections between those two indexes will be selected. 3. If a string of type <code>FieldSectionType</code> is provided, the first section with that name will be selected. 4. If <code>null</code> is provided, no section will be selected If not provided, the selected sections will be handled internally.",
    "shouldDisableDate": "Disable specific date.<br><br><strong>Signature:</strong><br><code>function(day: TDate, position: string) =&gt; boolean</code><br><em>day:</em> The date to test.<br><em>position:</em> The date to test, &#39;start&#39; or &#39;end&#39;.<br> <em>returns</em> (boolean): Returns <code>true</code> if the date should be disabled.",
    "showDaysOutsideCurrentMonth": "If <code>true</code>, days outside the current month are rendered:<br>- if <code>fixedWeekNumber</code> is defined, renders days to have the weeks requested.<br>- if <code>fixedWeekNumber</code> is not defined, renders day to fill the first and last week of the current month.<br>- ignored if <code>calendars</code> equals more than <code>1</code> on range pickers.",
    "slotProps": "The props used for each component slot.",
    "slots": "Overridable component slots.",
    "sx": "The system prop that allows defining system overrides as well as additional CSS styles. See the <a href=\"/system/getting-started/the-sx-prop/\">`sx` page</a> for more details.",
    "value": "The selected value. Used when the component is controlled.",
    "viewRenderers": "Define custom view renderers for each section. If <code>null</code>, the section will only have field editing. If <code>undefined</code>, internally defined view will be the used."
  },
  "classDescriptions": {},
  "slotDescriptions": {
    "ActionBar": "Custom component for the action bar, it is placed below the picker views.",
    "Day": "Custom component for day in range pickers.\nCheck the <a href=\"https://mui.com/x/api/date-pickers/date-range-picker-day/\">DateRangePickersDay</a> component.",
    "Dialog": "Custom component for the dialog inside which the views are rendered on mobile.",
    "Field": "",
    "FieldRoot": "Element rendered at the root.\nIgnored if the field has only one input.",
    "FieldSeparator": "Element rendered between the two inputs.\nIgnored if the field has only one input.",
    "Layout": "Custom component for wrapping the layout.\nIt wraps the toolbar, views, action bar, and shortcuts.",
    "LeftArrowIcon": "Icon displayed in the left view switch button.",
    "MobilePaper": "Custom component for the paper rendered inside the mobile picker&#39;s Dialog.",
    "MobileTransition": "Custom component for the mobile dialog <a href=\"https://mui.com/material-ui/transitions/\">Transition</a>.",
    "NextIconButton": "Button allowing to switch to the right view.",
    "PreviousIconButton": "Button allowing to switch to the left view.",
    "RightArrowIcon": "Icon displayed in the right view switch button.",
    "Shortcuts": "Custom component for the shortcuts.",
    "SwitchViewButton": "Button displayed to switch between different calendar views.",
    "SwitchViewIcon": "Icon displayed in the SwitchViewButton. Rotated by 180° when the open view is &#39;year&#39;.",
    "TextField": "Form control with an input to render a date or time inside the default field.\nIt is rendered twice: once for the start element and once for the end element.\nReceives the same props as <code>@mui/material/TextField</code>.",
    "Toolbar": "Custom component for the toolbar rendered above the views."
  }
}
