{
  "componentDescription": "It sets up the data providers as well as the `<svg>` for the chart.\n\nThis is a combination of both the `ChartDataProviderPro` and `ChartsSurface` components.",
  "propDescriptions": {
    "colors": { "description": "Color palette used to colorize multiple series." },
    "dataset": {
      "description": "An array of objects that can be used to populate series and axes data using their <code>dataKey</code> property."
    },
    "disableAxisListener": {
      "description": "If <code>true</code>, the charts will not listen to the mouse move event. It might break interactive features, but will improve performance."
    },
    "height": {
      "description": "The height of the chart in px. If not defined, it takes the height of the parent element."
    },
    "highlightedItem": {
      "description": "The highlighted item. Used when the highlight is controlled."
    },
    "id": {
      "description": "This prop is used to help implement the accessibility logic. If you don&#39;t provide this prop. It falls back to a randomly generated id."
    },
    "initialZoom": { "description": "The list of zoom data related to each axis." },
    "margin": {
      "description": "The margin between the SVG and the drawing area. It&#39;s used for leaving some space for extra information such as the x- and y-axis or legend. Accepts an object with the optional properties: <code>top</code>, <code>bottom</code>, <code>left</code>, and <code>right</code>."
    },
    "onHighlightChange": {
      "description": "The callback fired when the highlighted item changes.",
      "typeDescriptions": { "highlightedItem": "The newly highlighted item." }
    },
    "onZoomChange": {
      "description": "Callback fired when the zoom has changed.",
      "typeDescriptions": { "zoomData": "Updated zoom data." }
    },
    "series": {
      "description": "The array of series to display. Each type of series has its own specificity. Please refer to the appropriate docs page to learn more about it."
    },
    "skipAnimation": {
      "description": "If <code>true</code>, animations are skipped. If unset or <code>false</code>, the animations respects the user&#39;s <code>prefers-reduced-motion</code> setting."
    },
    "width": {
      "description": "The width of the chart in px. If not defined, it takes the width of the parent element."
    },
    "xAxis": {
      "description": "The configuration of the x-axes. If not provided, a default axis config is used. An array of [[AxisConfig]] objects."
    },
    "yAxis": {
      "description": "The configuration of the y-axes. If not provided, a default axis config is used. An array of [[AxisConfig]] objects."
    },
    "zAxis": { "description": "The configuration of the z-axes." }
  },
  "classDescriptions": {}
}
