{
  "1": "MUI X Charts: %s should be of type \"band\" to display the bar series of id \"%s\". Bar charts require a band scale for the category axis to properly position and size the bars. Set the scaleType to \"band\" for this axis.",
  "2": "MUI X Charts: %s should have a data property. The axis needs data to define the categories for the bar chart. Provide a data array to the axis configuration.",
  "3": "MUI X Charts: %s should be a continuous type to display the bar series of id \"%s\". Bar charts require a continuous scale (like \"linear\" or \"log\") for the value axis. Change the scaleType to a continuous type such as \"linear\".",
  "4": "MUI X Charts: The ChartsReferenceLine cannot have both `x` and `y` props set. A reference line can only be vertical (x) or horizontal (y), not both. Remove either the `x` or `y` prop.",
  "5": "MUI X Charts: The ChartsReferenceLine requires either an `x` or `y` prop. Without a value, the reference line cannot be positioned on the chart. Provide either an `x` value for a vertical line or a `y` value for a horizontal line.",
  "6": "MUI X: Prop '%s' is required but wasn't specified",
  "7": "MUI X: Expected prop '%s' to be of type Element",
  "8": "MUI X Charts: ChartsGroupedXAxis only supports the `band` and `point` scale types. Grouped axis ticks require an ordinal scale to display category groupings. Use a band or point scale type for the x-axis, or use a non-grouped axis component.",
  "9": "MUI X Charts: ChartsGroupedYAxis only supports the `band` and `point` scale types. Grouped axis ticks require an ordinal scale to display category groupings. Use a band or point scale type for the y-axis, or use a non-grouped axis component.",
  "10": "MUI X Charts: %s should have a data property to be able to display a line plot. The x-axis data defines the positions for each point in the line. Provide a data array to the x-axis configuration.",
  "11": "MUI X Charts: Could not find the Charts Slots context. This happens when the component is rendered outside of a ChartsDataProvider or ChartsContainer parent component, which means the required context is not available. Wrap your component in a ChartsDataProvider or ChartsContainer. This can also happen if you are bundling multiple versions of the library.",
  "12": "MUI X Charts: Could not find the charts localization context. This happens when the component is rendered without a ChartsLocalizationProvider. Wrap your component in a ChartsLocalizationProvider. This can also happen if you are bundling multiple versions of the `@mui/x-charts` package.",
  "13": "MUI X Charts: byteOffset must be 8-byte aligned. The spatial index requires proper memory alignment for performance. Ensure the byteOffset is a multiple of 8.",
  "14": "MUI X Charts: Data must be an instance of ArrayBuffer or SharedArrayBuffer. The spatial index requires a valid buffer to store data. Provide an ArrayBuffer or SharedArrayBuffer instance.",
  "15": "MUI X Charts: Data does not appear to be in a Flatbush format. The buffer does not contain valid spatial index data. Ensure you are loading data that was created by Flatbush.",
  "16": "MUI X Charts: Got v%s data when expected v%s. The spatial index data version is incompatible. Recreate the index using the current version.",
  "17": "MUI X Charts: Unrecognized array type in spatial index data. The data contains an unsupported typed array type. Recreate the index using a supported array type.",
  "18": "MUI X Charts: Missing required argument \"numItems\" for spatial index. The index needs to know how many items it will contain. Provide the expected number of items as the first argument.",
  "19": "MUI X Charts: Unexpected numItems value: %s. The spatial index requires a positive integer for numItems. Provide a positive number greater than 0.",
  "20": "MUI X Charts: Unexpected typed array class: %s. The spatial index only supports standard typed array types. Use one of: Int8Array, Uint8Array, Int16Array, Uint16Array, Int32Array, Uint32Array, Float32Array, or Float64Array.",
  "21": "MUI X Charts: Added %s items when expected %s. The number of items added does not match the expected count. Ensure you add exactly the number of items specified when creating the index.",
  "22": "MUI X Charts: Spatial index data not yet indexed. The search cannot be performed until indexing is complete. Call index.finish() before performing searches.",
  "23": "MUI X Charts: Spatial index data not yet indexed. The neighbors search cannot be performed until indexing is complete. Call index.finish() before performing neighbor searches.",
  "24": "MUI X Charts: Only one CartesianSeriesTypes instance can be created. This is a singleton class used internally for series type registration. Use the existing instance instead of creating a new one.",
  "25": "MUI X Charts: Only one PolarSeriesTypes instance can be created. This is a singleton class used internally for series type registration. Use the existing instance instead of creating a new one.",
  "26": "MUI X Charts: Received an unknown value \"%s\". Values must be a number, a string with a percentage (e.g., \"50%\"), or a string with pixels (e.g., \"100px\"). Provide a valid number or string format.",
  "27": "MUI X Charts: Line series with id=\"%s\" has no data. The chart cannot render this series without data. Provide a data property to the series or use the dataset prop.",
  "28": "MUI X Charts: The %s was not found. This is required to compute the radar chart dataIndex. Ensure the radar chart is properly initialized with all required axes.",
  "29": "MUI X Charts: Scatter series with id=\"%s\" has incomplete datasetKeys. Properties %s are missing. Scatter plots require both \"x\" and \"y\" keys to map dataset values to coordinates. Add the missing datasetKeys to the series configuration.",
  "30": "MUI X Charts: Could not find the Chart context. This happens when the component is rendered outside of a ChartsDataProvider or ChartsContainer parent component, which means the required context is not available. Wrap your component in a ChartsDataProvider or ChartsContainer. This can also happen if you are bundling multiple versions of the library.",
  "31": "MUI X Charts: Failed assertion - this component should not be rendered. This is an internal component used for styling purposes only. If you see this error, there may be a configuration issue with styled components.",
  "32": "MUI X Charts: Could not find the charts context. This happens when the component is rendered outside of a ChartsContainer parent component. Wrap your component in a ChartsContainer or ChartsDataProvider.",
  "33": "MUI X Charts: Bar series with id=\"%s\" has no data. The chart cannot render this series without data. Provide a data property to the series or use the dataset prop.",
  "34": "MUI X Charts: Series id \"%s\" is not unique. Each series must have a unique id to be properly identified and rendered. Provide a unique id for each series in your chart configuration.",
  "35": "MUI X Charts: Series id \"%s\" is not unique across series types. Each series must have a unique id even across different series types. Provide a unique id for each series in your chart configuration.",
  "36": "MUI X Charts: The id \"%s\" is not associated with any series. This may indicate the series was not properly registered or the id is incorrect. Verify the series id matches one defined in your chart configuration.",
  "37": "MUI X Charts: The x-axis uses `dataKey` but no `dataset` is provided. When using dataKey, a dataset must be provided to retrieve the axis data. Either provide a dataset prop or use the data property directly on the x-axis.",
  "38": "MUI X Charts: The y-axis uses `dataKey` but no `dataset` is provided. When using dataKey, a dataset must be provided to retrieve the axis data. Either provide a dataset prop or use the data property directly on the y-axis.",
  "39": "MUI X Charts: The %s-axis uses `dataKey` but no `dataset` is provided. When using dataKey, a dataset must be provided to retrieve the axis data. Either provide a dataset prop or use the data property directly on the %s-axis.",
  "40": "MUI X Charts: getAxisValue is not implemented for polar continuous axes. This function only supports ordinal (band/point) scales.",
  "41": "MUI X Charts: The z-axis uses `dataKey` but no `dataset` is provided. When using dataKey, a dataset must be provided to retrieve the axis data. Either provide a dataset prop or use the data property directly on the z-axis.",
  "42": "MUI X Charts: No identifier cleaner found for series type \"%s\". This internal error occurs when the series configuration is incomplete.",
  "43": "MUI X Charts: No identifier serializer found for series type \"%s\". This internal error occurs when the series configuration is incomplete.",
  "44": "MUI X Charts: range bar series with id='%s' has no data.\nEither provide a data property to the series or use the dataset prop.",
  "45": "MUI X Charts: range bar series with id='%s' has incomplete datasetKeys.\nProperties %s are missing.",
  "46": "MUI X Charts: Sankey series context is missing. Ensure the SankeyPlot is used inside a properly configured ChartDataProviderPro.",
  "47": "MUI X Charts: Sankey diagram contains circular references.",
  "48": "MUI X Charts: Point scale is not supported in FunnelChart. Please use band scale instead.",
  "49": "Expected prop '%s' to be of type Element",
  "50": "MUI X Charts: Sankey node with id='%s' is missing.",
  "51": "MUI X Charts: Failed to import 'rasterizehtml' module. This dependency is mandatory when exporting a chart as an image. Make sure you have it installed as a dependency.",
  "52": "MUI X Charts: Cannot export an image with zero width or height. Width: %spx. Height: %spx.",
  "53": "MUI X Charts: Failed to create blob from canvas.",
  "54": "MUI X Data Grid: The \"%s\" column type only accepts Date objects as values. Received value of type \"%s\" for row ID \"%s\", field \"%s\". Use valueGetter to transform the value into a Date object.",
  "55": "MUI X: Wrong drag direction",
  "56": "MUI X: Expected skeleton cells to be defined with `data-field` attribute.",
  "57": "MUI X: Failed assertion: should not be rendered",
  "58": "MUI X: The root element is not found.",
  "59": "MUI X: exportAs not supported.",
  "60": "MUI X: Missing the `getActions` property in the `GridColDef`.",
  "61": "MUI X: Missing context.",
  "62": "MUI X: Missing context. Quick Filter subcomponents must be placed within a <QuickFilter /> component.",
  "63": "MUI X: Missing context. Toolbar subcomponents must be placed within a <Toolbar /> component.",
  "64": "MUI X: Missing translation for key %s.",
  "65": "MUI X: Log level %s not recognized.",
  "66": "MUI X: You're not allowed to update several sub-state in one transaction. You already updated %s, therefore, you're not allowed to update %s in the same transaction.",
  "67": "MUI X Data Grid: Could not find the Data Grid context. This happens when a component is rendered outside of a DataGrid, DataGridPro, or DataGridPremium parent component. Ensure your component is a child of a Data Grid component. This can also happen if you are bundling multiple versions of the Data Grid.",
  "68": "MUI X Data Grid: Could not find the Data Grid configuration context. This happens when a component is rendered outside of a DataGrid, DataGridPro, or DataGridPremium parent component. Ensure your component is a child of a Data Grid component. This can also happen if you are bundling multiple versions of the Data Grid.",
  "69": "MUI X Data Grid: Could not find the Data Grid private context. This happens when a component is rendered outside of a DataGrid, DataGridPro, or DataGridPremium parent component. Ensure your component is a child of a Data Grid component. This can also happen if you are bundling multiple versions of the Data Grid.",
  "70": "MUI X Data Grid: useGridRootProps should only be used inside a Data Grid component. The component must be a child of DataGrid, DataGridPro, or DataGridPremium. Ensure your component is properly nested within a Data Grid.",
  "71": "MUI X: Invalid `logicOperator` property in the `GridFilterPanel`.",
  "72": "MUI X: Can't apply a strategy processor before defining an active strategy",
  "73": "MUI X: No processor found for processor \"%s\" on strategy \"%s\"",
  "74": "MUI X Data Grid: An element of the columnGroupingModel is missing both `field` and `groupId`. Each column group must have a groupId to identify it. Add a groupId to the column group definition.",
  "75": "MUI X Data Grid: The groupId \"%s\" is used multiple times in the columnGroupingModel. Each groupId must be unique within the column grouping model. Use unique groupId values for each column group.",
  "76": "MUI X Data Grid: The field \"%s\" appears multiple times in the columnGroupingModel. It is found in both: \"%s\" and \"%s\". Each field should only appear once in the grouping model.",
  "77": "MUI X Data Grid: The cell with id=%s and field=%s is not editable. Cell editing requires the cell to be marked as editable. Check the column definition and ensure editable is set to true, or verify the isCellEditable callback.",
  "78": "MUI X Data Grid: The cell with id=%s and field=%s is not in %s mode. The operation requires the cell to be in a specific editing mode. Ensure the cell is in %s mode before performing this operation.",
  "79": "MUI X Data Grid: The row with id=%s is not in %s mode. The operation requires the row to be in a specific editing mode. Ensure the row is in %s mode before performing this operation.",
  "80": "MUI X Data Grid: No grid root element available for print export. The grid must be mounted before exporting. Ensure the DataGrid component is rendered and visible before calling exportDataAsPrint.",
  "81": "MUI X Data Grid: No filter operators found for column \"%s\". Columns must have filter operators defined to enable filtering. Add filterOperators to the column definition or use a column type that includes them.",
  "82": "MUI X Data Grid: No filter operator \"%s\" found for column \"%s\". The specified operator is not available for this column. Use one of the operators defined in the column's filterOperators array.",
  "83": "MUI X: `pageSize` cannot exceed 100 in the MIT version of the DataGrid.\nYou need to upgrade to DataGridPro or DataGridPremium component to unlock this feature.",
  "84": "MUI X: `rowSelectionModel` can only contain 1 item in DataGrid.\nYou need to upgrade to DataGridPro or DataGridPremium component to unlock multiple selection.",
  "85": "MUI X: The Data Grid component requires all rows to have a unique `id` property.\nAlternatively, you can use the `getRowId` prop to specify a custom id for each row.\n%s\n%s",
  "86": "MUI X: Unable to prepare a partial update if a full update is not applied yet.",
  "87": "MUI X: No row with id #%s found",
  "88": "MUI X: You cannot update several rows at once in `apiRef.current.updateRows` on the DataGrid.\nYou need to upgrade to DataGridPro or DataGridPremium component to unlock this feature.",
  "89": "MUI X: No row with id #%s found.",
  "90": "MUI X: Only group nodes can be expanded or collapsed.",
  "91": "MUI X: You cannot replace rows using `apiRef.current.unstable_replaceRows` on the DataGrid.\nYou need to upgrade to DataGridPro or DataGridPremium component to unlock this feature.",
  "92": "MUI X: `apiRef.current.unstable_replaceRows` is not compatible with tree data and row grouping",
  "93": "MUI X: The row reordering does not support reordering of footer or grouping rows.",
  "94": "MUI X: The 'inside' position is only supported for tree data. Use 'above' or 'below' for flat data.",
  "95": "MUI X: Target row with id #%s not found in current view.",
  "96": "MUI X: Source row with id #%s not found in current view.",
  "97": "MUI X Data Grid: No row with id \"%s\" found. The row to reorder does not exist in the grid. Verify the row id is correct and the row exists.",
  "98": "MUI X Data Grid: Row reordering does not support reordering of footer or grouping rows. Only leaf (data) rows can be reordered. Ensure you are only reordering data rows.",
  "99": "MUI X: No filter operator found for column '%s'.",
  "100": "MUI X: serverOptions.minDelay is larger than serverOptions.maxDelay",
  "101": "MUI X: serverOptions.groupKeys must be defined to compute tree data",
  "102": "MUI X: serverOptions.groupKeys must be defined to compute row grouping data",
  "103": "MUI X: serverOptions.groupFields must be defined to compute row grouping data",
  "104": "MUI X: serverOptions.minDelay is larger than serverOptions.maxDelay ",
  "105": "MUI X: queryOptions.pivotModel must be defined to compute pivoting data",
  "106": "MUI X: Unknown dataset",
  "107": "MUI X: Could not fetch the data",
  "108": "MUI X: Could not update the row with the id %s",
  "109": "MUI X: Could not process prompt",
  "110": "MUI X: useDemoData tree data mode only works up to 1000 rows.",
  "111": "MUI X: The tree data grouping field does not exist.",
  "112": "MUI X Data Grid: DataGrid is not exported from @mui/x-data-grid-premium. The Premium package exports DataGridPremium instead. Use `import { DataGridPremium } from '@mui/x-data-grid-premium'` or import DataGrid from @mui/x-data-grid.",
  "113": "MUI X Data Grid: DataGridPro is not exported from @mui/x-data-grid-premium. The Premium package exports DataGridPremium instead. Use `import { DataGridPremium } from '@mui/x-data-grid-premium'`.",
  "114": "MUI X: Missing context. Collapsible subcomponents must be placed within a <Collapsible /> component.",
  "115": "MUI X: Missing context. Prompt Field subcomponents must be placed within a <PromptField /> component.",
  "116": "MUI X: Missing context. ResizablePanel subcomponents must be placed within a <ResizablePanel /> component.",
  "117": "MUI X: Could not find the Data Grid charts integration context.\nIt looks like you rendered your component outside of a DataGrid, DataGridPro or DataGridPremium parent component.\nThis can also happen if you are bundling multiple versions of the Data Grid.",
  "118": "MUI X: Conversation not found",
  "119": "MUI X: No `pivotingColDef()` prop provided with to the Data Grid, but response contains `pivotColumns`.\n\nYou need a callback to return at least a field column prop for each generated pivot column.\n\nSee [server-side pivoting](https://mui.com/x/react-data-grid/server-side-data/pivoting/) documentation for more details.",
  "120": "MUI X: Header name for a column group based on %s cannot be converted to a string.",
  "121": "MUI X: No `getGroupKey` method provided with the dataSource.",
  "122": "MUI X: No `getChildrenCount` method provided with the dataSource.",
  "123": "MUI X: The row reordering do not support reordering of footer rows.",
  "124": "MUI X Data Grid: DataGrid is not exported from @mui/x-data-grid-pro. The Pro package exports DataGridPro instead. Use `import { DataGridPro } from '@mui/x-data-grid-pro'` or import DataGrid from @mui/x-data-grid.",
  "125": "MUI X Data Grid: DataGridPremium is not exported from @mui/x-data-grid-pro. For Premium features, use @mui/x-data-grid-premium with a Premium plan license. Otherwise, use `import { DataGridPro } from '@mui/x-data-grid-pro'` for Pro features.",
  "126": "MUI X: No row node found for id #%s",
  "127": "MUI X: Row node for id #%s not found after move",
  "128": "MUI X Data Grid: No row with id \"%s\" found. The source row for reordering does not exist in the grid. Verify the row id is correct and the row exists.",
  "129": "MUI X Data Grid: No row with id \"%s\" found. The target row for reordering does not exist in the grid. Verify the row id is correct and the row exists.",
  "130": "MUI X Data Grid: Row reordering does not support reordering of footer rows. Footer rows are special rows that cannot be moved. Only data rows can be reordered.",
  "131": "MUI X Data Grid: Target row with id \"%s\" not found in current view. The target row may be filtered out or not visible. Ensure the target row is visible in the current grid view.",
  "132": "MUI X Data Grid: setRowIndex() is not supported for tree data. Tree data uses hierarchical positioning which requires setRowPosition(). Use setRowPosition() instead to reorder rows in tree data mode.",
  "133": "MUI X Data Grid: No getGroupKey method provided with the dataSource. Server-side tree data requires a getGroupKey method to determine row hierarchy. Add getGroupKey to your dataSource configuration.",
  "134": "MUI X Data Grid: No getChildrenCount method provided with the dataSource. Server-side tree data requires a getChildrenCount method to determine expandable rows. Add getChildrenCount to your dataSource configuration.",
  "135": "MUI X Data Grid: The values returned by getGroupKey for sibling rows must be unique. Rows with id \"%s\" and \"%s\" have the same path: %s. Ensure getGroupKey returns unique values for each sibling row.",
  "136": "MUI X Data Grid: No getTreeDataPath function provided. Tree data mode requires a getTreeDataPath prop to determine the hierarchy. Provide a getTreeDataPath function that returns the path array for each row.",
  "137": "MUI X Data Grid: The path returned by getTreeDataPath must be unique for each row. Rows with id \"%s\" and \"%s\" have the same path: %s. Ensure each row has a unique path in the tree structure.",
  "138": "MUI X Date Pickers: Missing dayjs UTC plugin. UTC and timezone support requires the dayjs UTC plugin to be enabled. See https://mui.com/x/react-date-pickers/timezone/#day-js-and-utc for setup instructions.",
  "139": "MUI X Date Pickers: Missing dayjs timezone plugin. Timezone support requires both the dayjs UTC and timezone plugins to be enabled. See https://mui.com/x/react-date-pickers/timezone/#day-js-and-timezone for setup instructions.",
  "140": "MUI X: Missing timezone plugin.\nTo be able to use timezones, you have to pass the default export from `moment-timezone` to the `dateLibInstance` prop of `LocalizationProvider`.\nFind more information on https://mui.com/x/react-date-pickers/timezone/#moment-and-timezone",
  "141": "MUI X: min date must be on or after 1356-01-01 H (1937-03-14)",
  "142": "MUI X: max date must be on or before 1499-12-29 H (2076-11-26)",
  "143": "MUI X Date Pickers: The date adapter should be imported from `@mui/x-date-pickers` or `@mui/x-date-pickers-pro`, not from `@date-io`. Using adapters from @date-io directly is not supported. For example, use `import { AdapterDayjs } from '@mui/x-date-pickers/AdapterDayjs'` instead of `import AdapterDayjs from '@date-io/dayjs'`. See https://mui.com/x/react-date-pickers/quickstart/#installation",
  "144": "MUI X Date Pickers: Unknown view \"%s\" found in MultiSectionDigitalClock. This view is not supported by the component. Use valid view values: \"hours\", \"minutes\", \"seconds\", or \"meridiem\".",
  "145": "MUI X: Cannot call sectionListRef.%s before the mount of the component.",
  "146": "MUI X: The `usePickerTextFieldOwnerState` can only be called in components that are used inside a PickerTextField component",
  "147": "MUI X: You must provide the type for ClockView",
  "148": "MUI X: The `usePickerActionsContext` can only be called in fields that are used as a slot of a Picker component",
  "149": "MUI X: Can not find the date and time pickers localization context.\nIt looks like you forgot to wrap your component in LocalizationProvider.\nThis can also happen if you are bundling multiple versions of the `@mui/x-date-pickers` package",
  "150": "MUI X: Can not find the date and time pickers adapter from its localization context.\nIt looks like you forgot to pass a `dateAdapter` to your LocalizationProvider.",
  "151": "MUI X: The `usePickerContext` hook can only be called inside the context of a Picker component",
  "152": "MUI X: PickersInputBase should always be used inside a PickersTextField component",
  "153": "MUI X Date Pickers: The `views` prop must contain at least one view. The date picker needs at least one view to display. Add a valid view to the views array (e.g., [\"year\", \"month\", \"day\"]).",
  "154": "MUI X: The format expansion seems to be in an infinite loop. Please open an issue with the format passed to the component.",
  "155": "MUI X: Should not call `commitToken` with an empty token",
  "156": "MUI X: The token %s should have a 'maxLength' property on it's adapter",
  "157": "MUI X: The token \"%s\" is not supported by the Date and Time Pickers.\nPlease try using another token or open an issue on https://github.com/mui/mui-x/issues/new/choose if you think it should be supported.",
  "158": "MUI X:Invalid section type",
  "159": "MUI X: The `sectionListRef` prop has not been initialized by `PickersSectionList`\nYou probably tried to pass a component to the `textField` slot that contains an `<input />` element instead of a `PickersSectionList`.\n\nIf you want to keep using an `<input />` HTML element for the editing, please add the `enableAccessibleFieldDOMStructure={false}` prop to your Picker or Field component:\n\n<DatePicker enableAccessibleFieldDOMStructure={false} slots={{ textField: MyCustomTextField }} />\n\nLearn more about the field accessible DOM structure on the MUI documentation: https://mui.com/x/react-date-pickers/fields/#fields-to-edit-a-single-element",
  "160": "MUI X: You must not mix controlling and uncontrolled mode for `open` prop",
  "161": "MUI X: The `usePickerRangePositionContext` can only be called in components that are used inside a picker component",
  "162": "MUI X: Unknown valueType: %s",
  "163": "MUI X: The timezone of the start and the end date should be the same.",
  "164": "MUI X: Gesture must be initialized with a valid name.",
  "165": "MUI X: Gesture can't be created with a native event name. Tried to use \"%s\". Please use a custom name instead.",
  "166": "MUI X: Pointer with id %s does not exist",
  "167": "MUI X: Mouse pointer can only be used in mouse mode",
  "168": "MUI X: Mouse mode only supports one pointer",
  "169": "MUI X: Plugin with name \"%s\" already exists. Please use a unique name.",
  "170": "MUI X: Target element is required for move gesture",
  "171": "MUI X: Target element is required for pan gesture",
  "172": "MUI X: Target element is required for pinch gesture",
  "173": "MUI X: Pinch gesture requires at least 2 pointers",
  "174": "MUI X: Target element is required for press gesture",
  "175": "MUI X: Target element is required for rotate gesture",
  "176": "MUI X: Rotate gesture requires at least 2 pointers",
  "177": "MUI X: Target element is required for tap gesture",
  "178": "MUI X: Target element is required for turnWheel gesture",
  "179": "MUI X: Unsupported number of selectors. The createSelector function supports up to 8 input selectors. Consider combining selectors or restructuring your selector logic.",
  "180": "MUI X: Missing arguments for createSelector. At least one selector function is required. Provide one or more selector functions as arguments.",
  "181": "MUI X: Unsupported number of arguments for selector combiner. The combiner function supports up to 3 additional arguments beyond the selector outputs. Consider restructuring your selector to use fewer arguments.",
  "182": "MUI X: Unsupported number of arguments for selector. The memoized selector supports up to 3 additional arguments. Consider restructuring your selector to use fewer arguments.",
  "183": "MUI X: Unhandled license status encountered in watermark display. This is an internal error indicating an unknown license status. Please report this issue if you encounter it.",
  "184": "MUI X: Invalid scope provided for license generation. The scope \"%s\" is not recognized. Valid scopes are: %s.",
  "185": "MUI X: Invalid licensing model provided for license generation. The licensing model \"%s\" is not recognized. Valid models are: %s.",
  "186": "MUI X: Only ASCII characters are supported in license encoding. Non-ASCII characters cannot be encoded. Ensure the input contains only ASCII characters.",
  "187": "MUI X: Expired license key.\n\nYour annual license key to use MUI X %s in non-production environments has expired. If you are seeing this development console message, you might be close to breach the license terms by making direct or indirect changes to the frontend of an app that render a MUI X %s component (more details in https://mui.com/r/x-license-annual).\n\nTo solve the problem you can either:\n\n- Renew your license https://mui.com/r/x-get-license and use the new key\n- Stop making changes to code depending directly or indirectly on MUI X %s's APIs\n\nNote that your license is perpetual in production environments with any version released before your license term ends.\n\n- License key expiry timestamp: %s\n- Installed license key: %s",
  "188": "MUI X: The release information is missing and license validation cannot proceed. This is an internal error that should not occur in normal usage. Please report this issue if you encounter it.",
  "189": "MUI X: The release information is invalid and license validation cannot proceed. The package release timestamp could not be parsed. This may indicate a corrupted package. Try reinstalling the MUI X packages.",
  "190": "MUI X Tree View: Could not find the Tree View context. This happens when a component is rendered outside of a SimpleTreeView or RichTreeView parent component. Ensure your component is a child of a Tree View component. This can also happen if you are bundling multiple versions of the Tree View.",
  "191": "MUI X Tree View: Invalid range - unable to find a path between the two items. This may occur if the items are not in the same tree or the tree structure is invalid. Verify that both items exist in the tree.",
  "192": "MUI X Tree View: All items must have a `label` property. You can use the `getItemLabel` prop to specify a custom label for each item. An item was provided without a label: %s",
  "193": "MUI X Tree View: All items must have a unique `id` property. You can use the `getItemId` prop to specify a custom id for each item. An item was provided without an id: %s",
  "194": "MUI X Tree View: All items must have a unique `id` property. The id \"%s\" is used by multiple items. Use the `getItemId` prop to specify a custom id for each item if needed.",
  "195": "MUI X: The Tree View component requires all items to have a unique `id` property.\nAlternatively, you can use the `getItemId` prop to specify a custom id for each item.\nTwo items were provided with the same id in the `items` prop: \"%s\"",
  "196": "MUI X: Could not find the Tree View Children Item context.\nIt looks like you rendered your component outside of a SimpleTreeView parent component.\nThis can also happen if you are bundling multiple versions of the Tree View.",
  "197": "MUI X: The Tree View component requires all items to have a `label` property.\nThe label of an item cannot be empty.\nItem ID: %s",
  "198": "MUI X: RichTreeViewItems only supports flat DOM structure when virtualized.",
  "199": "MUI X: There is no ongoing reordering.",
  "200": "MUI X: Unimplemented: colspan feature is required",
  "201": "MUI X: Unimplemented: rowspan feature is required"
}
